{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why can the same temperature feel completely different on different days or seasons?", "answer": "How much sun is directly shining on your body and humidity play a very large part in how a temperature feels."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why does acne occur frequently during puberty?", "answer": "It's a side-effect of the huge changes in hormone levels that take place in this period. Skin becomes oilier and there is an increase in dead skin both of which can block pores and cause infections. Experimentation with make-up and skin care products at this age frequently exacerbate problems."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "How does my phone know when I'm sleeping?", "answer": "Phone accelerometers are obnoxiously sensitive. I'm not familiar with this thing you're talking about, but it was popular to have alarm apps that would track your sleep cycles to wake you up when you weren't quite so deep in sleep so it's easier to wake up. This was accomplished by sitting the phone on the mattress and it could tell how much you were moving around. Less moving meant deeper sleep. However, some of them were clever enough to make sure they detected breathing movements (the phone can't tell that apart from other movement, but it would be fairly regular) otherwise, if it were actually on a night stand or something, it would just think you were deep in a REM cycle forever, since the night stand isn't really going to move as you shift in bed."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why do almost all animals have red blood?", "answer": "Because most animals have a oxygen transporting blood cell which uses the molecule haemoglobin as an oxygen transporter. Haemoglobin is famous for it's iron (Fe) content, which imparts the reddish color, especially when oxygenated . Horseshoe crabs have copper based oxygen carry systems and their blood is blue"}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why is smoking so bad for the heart?", "answer": "A heart attack is what happens when something (a blood clot, a bit of fat/cholesterol/plaque, etc) blocks one the arteries that supply blood and nutrients to the heart. Smoking impacts this in two ways. First, it causes your blood to thicken and clot more easily, which means clots are more likely to form inside your blood vessels where they're not supposed to. Second, it irritates the lining of your blood vessels, causing them to swell and become less flexible, which makes them narrower and easier to clog. This is also why smoking increases the risk of stroke, which is when the same thing happens to an artery leading to the brain.\n\nIt's also worth mentioning that both of those effects are temporary. According to the CDC, the increased risk largely goes away within a year of quitting smoking. However, heart damage from actually having a heart attack is permanent."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "My understanding is that 1 company in Taiwan makes the greatest microchips in the world and no one else can replicate them. How is that possible?", "answer": "That's not entirely true\n\nTSMC (Taiwan Semiconductor Manufacturing Company Limited) is one of the premiere chip manufacturing companies in the world but they are hardly the only one.\n\nThey are of note because they make everything from common chips used in everything from cars to cellphones to AMDs processors. Apple, Nvidia, AMD, and Qualcomm for example all use TSMC to manufacture their chips.\n\nBut Samsung (Korea) and Intel (US) also have chip foundries of that caliber.\n\nTSMCs secret is just that they have large numbers of highly experienced people working for them and have developed very good processes. Samsung and Intel are similar in that regard, but TSMC is special in that the Taiwanese government has in a sense made semiconductor manufacturing the countries primary industry.\n\nOther companies like Texas instruments can also make microchips and have facilities all over the US but can't make chips as complex as Computer microprocessors. Importantly though there's nothing stopping them from investing capital to build such a facility, they just don't want to. (Developing an in house microprocessor to compete with AMD and Intel at this point would require an outrageous investment)\n\nIsrael is also another big up and comer in chip manufacturing.\n\nWhy TSMC is of note is the Pandemic showed just how vulnerable the US and the West are to losing access to TSMC production. If China for example were to invade Taiwan it could be a really big problem for the economy and availability of these chips.\n\nThis is why TSMC is building a Chip Foundry in Texas Arizona right now so chip production can happen domestically in the US."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why is it easy to balance on a bicycle when it is moving but nearly impossible when it is stationary? ", "answer": "Bicycle (and motorcycle) dynamics are very complex. Physicists and mathematicians have been having trouble modeling exactly what makes two wheeled vehicles stable. Here's one stab at it.\n\nSome things are known to increase stability. The gyroscopic effect of the wheels plays a minor role. As /u/bjujey pointed out below, experiments have shown that removing the gyroscopic effect still makes for a stable bike.\n\nTrail also plays a role. Trail is the measurement of where the steering axis in relation to the contact of the wheel on the ground. Here's a picture for illustration. This is also called the caster effect. Basically the further forward the steering axis is from wheel contact with the ground, the more stable the bike. Track bikes and cyclocross bikes have really short trail to make them more agile. Big stable cruisers have long trails.\n\nLike gyroscopic effect, experiments have removed trail as a variable and these models are also stable. Here is an interview with a scientist who removed both gyroscopic and caster/trail effects in a model bicycle, and it remained stable.\n\ntl;dr: No one really knows what makes a moving bike stable.\n\nEdit: I guess I should mention it is possible to be stabilize a non-moving bike in a technique called a trackstand. Here's two track racers doing it on fixed gear bikes. Its a bit more complicated but still possible on bikes with a freewheel or freehub."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "How have we not run out of metal yet?", "answer": "There is lots of metal in the ground and we keep digging it up.\n\nAlso used metal can somewhat easily be reused (compared to other materials)\n\nWe have roughly 80 billion metric tons of iron ore in deposits, and over the last 15 years that actually increased because we discovered more deposits than we mined. Per year we mine about 2.5 billion tons, so if we discover no more iron we'd run out in less than 40 years (but it slows down as recycling rate increases)"}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why is a typical blood draw done at the fold of your arm?", "answer": "The large blood vessels typically run between the bones under the muscle. This is where they are best protected so that only deep cuts damages them. There are a few places where the blood vessels have to come right under the skin though. The elbow is one of these places. They can not go between the bones because the bones in the elbow move a lot in relation to each other creating pinch points. And there are no muscles or even fat in your elbow to protect the blood vessels. So they run just under the skin making it easy to insert a needle into them. You can even see your blood vessels through the skin."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why is eating burnt food bad for you?", "answer": "Usually in burnt foods, a group of carcinogenic substances called polycyclic aromatic hydrocarbons (PAHs) are produced, and by consuming burnt foods, we are racking up these carcinogenic substances, substantially increasing the risk of cancer.\n\nSource: http://www.betterhealth.vic.gov.au/bhcv2/bhcarticles.nsf/pages/Cancer_and_food"}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "What happens to a plant when you pull a leaf off of it? Are you hurting it and is the plant able to recover?", "answer": "They don't feel pain so you're not \"hurting\" it really, but you are damaging it. The plant may or may not regrow a leaf in the same spot depeding on how bad the damage was and what kind of plant it is.\n\nThe plant uses those leaves to capture the sunlight, carbon dioxide, and oxygen that it uses to power itself. Pulling off a single leaf is usually inconsequential, but major loss of foliage can kill a plant that isn't ready for it.\n\nSome have enough loot stored in their roots and stems to re-grow enough leaves to recover even dramatic losses (like getting cut down to a stump), but others are quite sensitive and must be trimmed carefully."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Almost every cell in our body is able to regenerate. Why are the brain cells different? ", "answer": "Neurons in your brain would need to be both able to replace themselves, and then most importantly, spread their axons and dendrites to the appropriate location. Brain cells are a small cell body coupled with long tentacle like structures that stretch from place to place to form connections. This means that in a place like your spine, a single cell goes all the way from your brain to your tailbone, which means that the cell is about a meter long! Its easy enough for a new cell body to be put in the same place if the original gets damaged, but it would be very hard to make sure that cell then grew that extreme distance and connected back to the correct target.\n\nThere are some animals that have very impressive regenerative properties, but it just isn't something humans (or most mammals) are capable of. In the ancestral environment, an accident that was bad enough to leave you paralyzed was generally bad enough to kill you pretty quickly, which means that we never evolved a way to regenerate that kind of damage."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "If most of what we taste is determined by smell, why do some things that smell good taste bad?", "answer": "Because \"most\" =/= \"all\".\n\nThings that smell good and taste bad are things that usually have a strong bitter component to their flavor, which you can taste with your tongue, but not smell."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "How does lack of sleep kill someone?", "answer": "Imagine your brain as constantly generating trash, and sleep takes out the trash. If you don't sleep, your brain will drown itself in trash. That's the ELI5 version."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why do we need to constantly do software updates? What happens if I don't?", "answer": "There’s many reasons but the main 3 are security features, device compatibility, and new things being added.\n\nThe big one (and reason to regularly update) is security. Imagine securing software like trying to make a door that only you can walk through. After you use it enough times, other people trying to also walk through that door (steal your data, personal info, or financial info) might pick up on patterns and think of ways of keeping the door propped open, messing with the locks, etc. Security updates close these loopholes and keep the door only opening for you.\n\nAnother one is new devices. An app might’ve been written for the iPhone X but a few years later we’re now on the iPhone 15 with a completely different operating system and features that didn’t exist when the app was written. It needs to know how to recognize and interact with that new OS (and any future updates to the OS) or it could introduce bugs and crash the app.\n\nFinally, and most straight forward, is them adding new stuff to the software. As people use something they provide feedback and the company uses updates to add that feedback into the software."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why does running before jumping make us jump higher?", "answer": "When you jump, you need to use your muscles to give your body speed upwards. If you already have some speed, it is easier to redirect that speed than it is to create speed from scratch.\n\nSo you're taking your sideways speed and converting it to upwards speed."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why do we tend to think a lot before sleeping?", "answer": "Because there's nothing else distracting you like phones or tv. You're just lying there with nothing else to entertain you."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why are airplanes boarded front to back?", "answer": "There are absolutely more efficient ways to load an airplane besides the common current practices.\n\nBut there are other considerations; namely getting higher paying customers on first. Whether that is boarding first class so they can be served a drink or passengers who pay more so they can get overhead bin space. "}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why do different animals have different life spans?", "answer": "Life span is a pretty complicated topic, but we can understand it by using what is known as life history theory.  This is basically the idea that the timing of life events such as how long an animal grows, when and how many times it reproduces, and when it dies are developed through the process of natural selection.  As such, total lifespan for a given species has evolved in a manner similar to any other adaptation, and is related to what will allow that animal to survive, and more importantly, to reproduce in a given environment.\n\nSo what are some factors that influence life history and life span?\n\nLife history and average age at death are often linked to body size, and with some exceptions (like bats) larger body size is associated with a longer life span.  For example, mice live a year or maybe two and have what we call a “fast” life history, while a large whale or elephant will live for decades with a “slow” life history.  But why do some animals have a fast life and some a slow life?\n\nPart of this can be explained by looking at extrinsic mortality and how animals have to partition their energetic resources.  An animal can put its energy into either growth, bodily maintenance or reproduction. However energy input is ultimately limited by the environment, so an animal cannot invest into all three infinitely and must therefore partition how much effort it will place into each of these categories. Basically, do you grow a lot, get big, and reproduce only a few offspring? Or do you grow quickly, stay small and reproduce a lot of kids?\n\nOne thing that helps decide this is that all animals face extrinsic mortality - basically the likelihood you’ll be taken out by another animal (e.g. predation) or by the environment (e.g., changing seasons, flooding, etc.). If you are faced with high extrinsic mortality, this favors getting in the game reproductively early in life.  In these species you in turn see less investment in growth and bodily maintenance.  They therefore tend to be small, live a short period of time and produce a lot of kids they don’t put a ton of investment into.  Think mice, mayflies and the like.  In contrast, animals with lower extrinsic mortality tend to take time to grow larger (which also further reduces extrinsic mortality), and take a longer time reproducing a smaller number of individuals whom they put a lot of investment into getting to survive their growth into adulthood (think primates, whales and elephants).  \n\nAs long-lived, smart primates we often think of our “slow” life history as “better” than a mouse’s short life.  It’s important to recognize that these are simply different, but equally effective, strategies for getting your genes into the next generation.  While a slow life history allows for the development of things like our big brain and tapping on a phone, our mouse friends ultimately have pretty effective strategy in terms of natural selection as well. I’ve really only scratched the surface here, and there are a ton of other factors to look at when it comes to lifespan (e.g., BMR, phylogenetic effects, etc.), but if you are interested there is a lot out there on life history theory."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "What would happen to my body if I were trapped somewhere with a reliable water supply but no food?", "answer": "Your body would start consuming its fat stores, and after that muscle.\n\nYou become irritable, irrational, and lethargic.\n\nYour stomach shrinks and you stop feeling hungry.\n\nYou run the risk of dehydration, because you no longer thirst much either.\n\nYou suffer for nutritional deficiencies like anemia and scurvy.\n\nYou develop sores and rashes and your hair starts falling out.\n\nYou become susceptible to disease.\n\nYour body temperature starts to drop.\n\nYour electrolyte levels drop, and your heartbeat becomes irregular.\n\nYou become apathetic and your thoughts muddled, to the point you forget to drink, and wouldn't have the sense to feed yourself if someone handed you a sandwich."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why do most domestic animals enjoy being petted? ", "answer": "It's not unlike why we enjoy being held or hugged. Mammal children are evolved to draw comfort from physical contact with their parents, because it signals you're being protected. It releases primarily oxytocin, an important bonding hormone."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why is it that soap can wash almost anything off of your hands but doesn't wash its fragrance off of you?", "answer": "Most of the stuff on your hands is water soluble (hydrophilic, polar) while the fragrance isn't soluble in water (hydrophobic, nonpolar). "}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "What causes us to tear up when we cut onions? Is there a way to prevent this?", "answer": "There is an enzyme in the onion that causes the crying.\n\nFun fact it was recently found that this enzyme has no effect on the onions flavor, so yes with genetic modification we could in fact create tear free onions!"}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why is a runner's heart rate lower than that of a non-runner?", "answer": "Because their cardiovascular systems are strong. They've worked out their heart muscles to the point where they can get all the blood circulation they need with fewer beats. The heart only beats as fast as it needs to."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Can weather be controlled or man made? If so, to what extent and how?", "answer": "Short answer: yes to a very limited extent\n\nLonger answer: not in any realistic, safe, or controllable way.\n\nWeather is super complicated and often pretty hard to predict. Imagine if you had a big bowl of water and you kept sloshing it around, meteorology is guessing/analyzing where individual waves will form.\n\nYou can effect the weather by large releases of heat or particulates, but both have enormous ecological impacts and are expensive. Also if you mess with the weather in one place you tend to fuck over somewhere else (a la butterfly effect).\n\nSo generally its not safe, cheap, or smart, but we could technically do it minorly."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why does my mouth sometimes spray saliva when I yawn?", "answer": "It's called gleeking, and it's because the salivary gland gets compressed."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "How do animals sense an upcoming earthquake?", "answer": "generally speaking, earthquakes propagate through p (pressure) waves and s (transverse) waves. think side to side and up and down. the p waves come first, and often are below your perception threshold (you just don't notice them). the S waves, which you are much more likely to notice, come after as they travel more slowly. these are what you are thinking of when you think of an earthquake.\n\nanimals like dogs are much more in tune to the preceding p waves, and noticed them before you do. that is why it appears they predict them just beforehand. they are not, they are just sensing them before you."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "What is the function of sleep?", "answer": "Your brain uses it as time to organize, commit short-term memory to long-term memory, and flush out toxins and waste that build up during the day.\n\nThat organization process is believed to be what dreaming is. Applying the knowledge it has in different ways and different situations, and reinforcing things it already learned.\n\nThe toxin flushing process requires neurons to retract and blood vessels to dilate to make more room for those toxins to be flushed out."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why can’t antibodies/other benefits of breastmilk, be added to baby formula?", "answer": "The current cost to add just one of the antibodies to breastmilk at the same concentration is around $10k per litre. They're insanely tricky to produce and purify. "}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "In an iPhone, where do deleted files and photos go after being deleting from 'recently deleted'?", "answer": "This is the same for all electronics. They aren't really deleted, they're just not indexed anymore and the device will eventually overwrite that sector of storage.\n\nEspecially with solid state drives, where the data is located physically doesn't really matter to your device. The drive itself pays attention to the physical location, but the device only cares about the address. Basically, the device goes \"Give me the data for the bit kept at location #123\" and the device knows that this virtual location is the transistor in row 501, column 729.\n\nWhen you delete data, what you're really doing is just deleting that entry in the device's address book. It forgets what is kept at location #123 and stops asking about it. The physical transistors aren't changed, yet, they just sit there with whatever bits were saved before. Eventually, your device will need to save new information, and it'll look in the address book to see which locations aren't being used. It'll see that location #123 is unused, and write the new data to that location. This overwrites the old data, which is the physical deletion of that data."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "What keeps the oceans from flooding the earth?", "answer": "Gravity. The gravity of the Earth pulls the oceans (and all liquids) to the lowest point they can go. That's why rivers flow downhill from mountains into the ocean.\n\nThe same force that keeps water inside your glass keeps the water of the oceans in the ocean."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why is it harder to fall asleep in noisy environments?", "answer": "Humans (and therefore our brains) evolved in a wild environment. Certain noises (or noises of certain pitches or volumes) are associated with various dangers, loud noises are usually signs of threats for example (people shout when scared or hurt), and the sound of rustling leaves nearby could be the sound of a moving predator. Even though most of those threats are irrelevant to you in your daily life these processes are ingrained in the way your brain develops. When you hear these threat noises, your brain reacts, it becomes alert and readies you to fight or run. This alertness prevents sleep because you are vulnerable when asleep."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why do we still use gigantic TV studio cameras when the same technology is now cell phone sized?", "answer": "A larger lens gathers more light. Period. A larger lens weighs more which requires a larger frame to carry it. A larger frame allows for a larger sensor. A larger sensor generates more data which makes it easier to perform noise reduction. In short, that much larger camera is also MUCH more capable than your cell phone."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Is pain a completely accurate indicator of the condition of physical injuries?", "answer": "When I snapped my arm in half it didn't hurt at all. Nerve damage can lead to no pain, and is pretty serious. Disease such as leprosy can lead to lack of pain, leading to unnoticed injuries and infections."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "Why can't we exterminate fleas entirely? ", "answer": "They continue to exist on wild animals, such as deer and foxes, as well as in grass, carpet, etc. They are a source of food for many insectivores as well. There are also many many species of flea. It would be too massive of an undertaking to attempt to kill all of them without harming the animals that prey on them"}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "What exactly is going on with my computer when it crashes?", "answer": "Most of these answers are really bad. The most common causes of computer crashes are not infinite loops, memory overflows, or corrupted files. In fact all of those answers would only in rare cases cause the entire system to crash.\n\nThe most common cause of computer crashes are faulty hardware or faulty system drivers. Video card drivers are a very common cause of computer crashes. Corrupted memory also a common cause of crashes. Out of date drivers or system libraries can also cause crashing.\n\nBasically a crash is when your system tries to do something very low level like read memory, or display something to the screen and the result is something the computer cannot understand. Since there is no way back, and continuing could do unexpected and irreversible things the system just stops and forces you to restart to get it back into a normal state."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "If aging is, in a nutshell, the exhaustion of the body's capability to fix itself, why don't exercise and bodybuilding (in a healthy manner) make that capability worse?", "answer": "Because you're constantly making repairs necessary while your body is still very capable of adjusting itself, you end up with a better level of cell repair, stem cell activity, bone density, and muscle density.\n\nOnce all those things begin deteriorating with age, you're starting from a much higher baseline than someone with a sedentary lifestyle that never worked out. Meaning you won't hit critical levels of disrepair, but they will at some point."}
{"language": "English", "question_type": "culturally_agnostic", "question_english": "How do sheep turn grass and water into milk, wool and more sheep?", "answer": "Sheep like cows have an incredible bioreactor in them that turns the ingredients of grass into proteins through the use of their multi-chambered stomachs. They send all their time eating and food stays in their multiple stomachs where it's ground up, churned, mixed with acid, broken down by bacteria, the regurgitated as cud, them chewed up again to be further broken down by bacteria to transform it into the ingredients necessary to make more cow. We have significantly less complicated stomachs so we require a varied diet, but we don't have to spend all day eating. "}
